import { Accordion, AccordionItem } from "@szhsin/react-accordion";
import s from "./FAQ.module.css";
import { IoCloseOutline } from "react-icons/io5";
import { useState } from "react";
import "./FAQ.module.css";

const FAQs = () => {
  const accordionData = [
    {
      title: "Як мені відправити посилку з території України за кордон?",
      content:
        "Твої відправлення курсують країною через наш склад в с.Гостинцеве (Львівська обл.). Відправляй посилки на нього службою Нова Пошта: Львівська область, с. Гостинцеве, відділення №1 (До 1000 кг та об'ємом до 70 см x 170 см x 300 см) Отримувач: ФОП Кисіль Людмила Анатоліївна ЄДРПОУ: 3221718269 +380 (95) 801-04-74",
    },
    {
      title: "Як ми рахуємо термін доставки посилки з України за кордон?",
      content:
        "Час доставки рахується з моменту виїзду твоєї посилки з нашого складу в Україні (с. Гостинцеве, Львівська обл.). Мінімальний термін – від 2-х днів (працюємо без вихідних)",
    },
    {
      title: "Чи застрахована моя посилка та скільки це коштує?",
      content:
        "Авжеж! Всі посилки з України до Польщі застраховані,страховий платіж становить 3% від оголошеної вартості. Всі посилки з Польщі до України застраховані, страховий платіж становить 1% від оголошеної вартості. Це обов’язковий страховий внесок, що захищає твою посилку.",
    },
    {
      title: "Як знизити вартість пересилки з України?",
      content:
        "Якщо твою посилку упаковують вже на пошті, уважно контролюй відповідність розмірів пакування до реальних розмірів твоєї посилки! Кожен зайвий сантиметр додасть вартості:( Тож проси оператора підрізати коробку, якщо вона завелика. Так-так, ти маєш на це право! Як підрізати коробку самостійно, дивись в цьому відео!",
    },
    {
      title: "Хто має сплачувати відправку?",
      content:
        "– якщо посилка їде з України, сплатити її може як отримувач, так і відправник – якщо посилка їде до України, сплачує її виключно відправник",
    },
    {
      title: "Що не можна перевозити з України до Євросоюзу?",
      content:
        "алкоголь тютюн (у будь-яких його формах) та електронні сигарети дорогоцінні метали гроші м’ясні продукти та сало молочну продукцію ікру риб вироби з хутра та інше Посилки з забороненими речовинами чи речима повертаються відправнику за додаткові кошти.",
    },
    {
      title: "Чи можу я відправити до України дороговартісну посилку?",
      content:
        "Якщо вартість посилки перевищує 1000 зл., відправник доплачує 10% від різниці. Як рахуємо? Приклад: 1500 zł -1000 zł = 500 zł х 10% = 50 zł (доплата) Цю суму ми додаємо до вартості тарифу.",
    },
    {
      title:
        "Як замовити посилку з українського інтернет-магазину та доставити її в Європу?",
      content:
        "Коли ти купуєш товар в інтернет-магазині, роби наступне: Впиши ці дані доставки: Нова Пошта, Львівська область, с. Гостинцеве, відділення №1 (До 1000 кг та об'ємом до 70 см x 170 см x 300 см) Отримувач: ФОП Кисіль Людмила Анатоліївна ЄДРПОУ: 3221718269 +380 (95) 801-04-74 Заповни цю форму. Так ми дізнаємось, куди відправляти твою посилку:) Коли посилка буде на території Польші, ти отримаєш SMS від IVANCOM",
    },
  ];
  const [activeIndex, setActiveIndex] = useState(null);

  const handleClickRotate = (index) => {
    setActiveIndex(activeIndex === index ? null : index);
  };

  return (
    <div className={s.faq}>
      <Accordion className={s.acc}>
        {accordionData.map((item, index) => (
          <AccordionItem
            key={index}
            onClick={() => handleClickRotate(index)}
            header={
              <div className={s.headeracc}>
                <p className={s.titleacc}>{item.title}</p>
                <IoCloseOutline
                  size={28}
                  className={`${s.icon} ${
                    activeIndex === index ? s.rotate : ""
                  }`}
                />
              </div>
            }
            className={s.accitem}
          >
            <div className={s.accdesc}>{item.content}</div>
          </AccordionItem>
        ))}
      </Accordion>
    </div>
  );
};

export default FAQs;
