import s from "./Helping.module.css";
import HelpingGallery from "./HelpingGallery/HelpingGallery";
import helping from "./helping.jpg";

const Helping = () => {
  return (
    <>
      <div className={s.bg}>
        <div className={s.container}>
          <h2 className={s.title}>IVANCOM ДОПОМАГАЄ</h2>
          <div className={s.content}>
            <img
              src={helping}
              alt="Гуманітарна допомога з Іспанії"
              className={s.image}
            />
            <div className={s.text}>
              <p>
                Ми волонтеримо від самого початку існування нашої компанії – з
                2019 року!
              </p>
              <p>
                На самому початку ми допомагали Будинку Дитини №2 у м. Львів для
                дітей з ураженням центральної нервової системи та порушенням
                психіки. Ми розміщували оголошення в різних группах у ФБ і люди
                не залишались байдужими та приносили до нашого офісу дуже багато
                речей, солодощів, памперсів, канцтоварів, взуття, іграшок і тд.
                Також, ми організовували збір сухих кормів та ковдр для тварин з
                Притулку “Милосердя” у м. Львів. Песики дуже тішились, коли ми
                привозили їм смаколики та приділяли хоч-якусь увагу. Дякуємо
                всім тим, хто не залишився осторонь та допомагав нам на самому
                початку нашого шляху у волонтерстві.
              </p>
              <p>
                Найбільшим випробуванням для команди IVANCOM, як і для кожного,
                був початок повномасштабної війни в Україні. Ми почали з того,
                що організували збір одноразового посуду , продуктів харчування
                та води для людей, які стояли в величезній черзі на кордоні,
                тікаючи від війни... Наші телефони цілодобово розривались від
                дзвінків. Люди просили допомоги, яка базувалась на тому, щоб
                відвезти їх з Львівського залізничного вокзалу до кордону з
                Польщею. Саме тоді ми вирішили безкоштовно возити жінок, дітей
                та літніх людей зі Львова до брами на кордоні, аби вони не
                мерзли в черзі.
              </p>
              <p>
                Зробивши багато запитів на різні потреби військових та цивільних
                в Україні наші відділення були завалені гуманітарною допомогою з
                Іспанії, Ізраїлю, США, Скандинавії, Великої Британії та Данії.
                Цю допомогу ми розформовували та надіслали, як благодійним
                організаціям на сході України для подальшого перерозподілу, так
                і звичайним громадянам, які до нас звертались.
              </p>
            </div>
          </div>
          <div className={s.textfull}>
            <p>
              Також ми організовували збір коштів на придбання позашляховика та
              хірургічної причепи на Запорізький напрямок фронту. Вже за
              декілька днів кошти від небайдужих людей були на рахунку та
              нарешті цей життєво-необхідний транспорт був придбаний. Причепу ми
              назвали Єва, а позашляховик Люся, укомплектували їх медичними
              препаратами та всім необхідним для поранених військових і
              відправили їх на фронт. Окрім цього, було ще передано безліч
              батарейок, термобілизни, турнікетів, сухпайків, павербанків,
              ліків, бронежилетів, рацій, одягу та багато багато іншого для
              наших неймовірних захисників та захисниць. А ще був організований
              збір коштів на придбання тепловізора для хлопців з 26-ого окремого
              стрілецького батальйону на Шахтарському напрямку, під час якого
              нам вдалось зібрати потрібну суму, придбати тепловізор та
              відправити його на фронт.
            </p>
            <p>
              Разом з благодійною організацією StepByStep ми організовували ще
              декілька благодійних зборів. А саме, ми збирали металеві бляшанки
              та віск для окопних свічок, щоб нашим захисникам та захисницям
              було світло та тепло. Збір допомоги для потерпілих від наслідків
              аварії на Херсонській ГЕС. Збір допомоги для поранених військових
              у лікарні. Збір допомоги для далекобійників, які стоять вже не
              перший місяць у чергах на кордоні.
            </p>
            <br />
            <p>
              <strong>
                Далі - більше! Дякуємо тобі, що не залишаєшся байдужим і стаєш
                частиною великої та доброї справи!
              </strong>
            </p>
          </div>
        </div>
      </div>
      <div className={s.truck}>
        <div className={s.containertruck}>
          <h2 className={s.heading}>
            Везли хірургічний причеп та позашляховик на Запорізький напрямок
          </h2>
          <p className={s.descriptiontruck}>
            Наші друзі з усього світу допомагали в цьому та зняли невеличкий
            фільм.
          </p>
          <div className={s.videoContainertruck}>
            <iframe
              src="https://www.youtube.com/embed/xrK5peXBzwU"
              title="YouTube video player"
              frameBorder="0"
              allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
              allowFullScreen
            ></iframe>
          </div>
        </div>
      </div>
      <HelpingGallery />
    </>
  );
};

export default Helping;
